api_test_scripts/load-testing/scenarios/session.yml
# Session Load Test Scenario
# Tests authentication and profile access under load
# Run with: npm run load-test:session

config:
  target: "{{ $processEnvironment.API_TEST_BASE_URL || 'https://api-test.indealeg.com' }}"
  phases:
    # Warm-up
    - duration: 20
      arrivalRate: 2
      name: "Warm-up"
    # Ramp-up
    - duration: 40
      arrivalRate: 2
      rampTo: 20
      name: "Ramp-up"
    # Peak load
    - duration: 60
      arrivalRate: 20
      name: "Peak load"
    # Sustained
    - duration: 60
      arrivalRate: 15
      name: "Sustained"
    # Cool-down
    - duration: 20
      arrivalRate: 5
      name: "Cool-down"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  payload:
    path: "../../config/test-data.json"
    fields:
      - "users"

  plugins:
    expect: {}

  variables:
    baseUrl: "/api/v1"

scenarios:
  # Quick login/logout
  - name: "Quick Login"
    weight: 5
    flow:
      - post:
          url: "{{ baseUrl }}/auth/login"
          json:
            email: "{{ users[0].email }}"
            password: "{{ users[0].password }}"
          capture:
            - json: "$.data.accessToken"
              as: "accessToken"
          expect:
            - statusCode: [200, 401]
      - think: 1
      - post:
          url: "{{ baseUrl }}/auth/logout"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          ifTrue: "accessToken"

  # Full session flow
  - name: "Full Session"
    weight: 3
    flow:
      - post:
          url: "{{ baseUrl }}/auth/login"
          json:
            email: "{{ users[0].email }}"
            password: "{{ users[0].password }}"
          capture:
            - json: "$.data.accessToken"
              as: "accessToken"
          expect:
            - statusCode: [200, 401]
      
      - think: 2
      
      - get:
          url: "{{ baseUrl }}/users/me"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          ifTrue: "accessToken"
          expect:
            - statusCode: [200, 401]
      
      - think: 1
      
      - get:
          url: "{{ baseUrl }}/companies/me"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          ifTrue: "accessToken"
          expect:
            - statusCode: [200, 401]
      
      - think: 1
      
      - get:
          url: "{{ baseUrl }}/companies/me/gallery"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          ifTrue: "accessToken"
      
      - think: 1
      
      - get:
          url: "{{ baseUrl }}/companies/me/contributions"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          ifTrue: "accessToken"
      
      - think: 2
      
      - post:
          url: "{{ baseUrl }}/auth/logout"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          ifTrue: "accessToken"

  # Failed login attempts
  - name: "Failed Login"
    weight: 2
    flow:
      - post:
          url: "{{ baseUrl }}/auth/login"
          json:
            email: "nonexistent@example.com"
            password: "wrongpassword"
          expect:
            - statusCode: [401, 400]